FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/spi_reg.h
#define SPI_CTL_TXNEG_Pos           ( 2 )                                                  /*!< SPI_T::CTL: TXNEG Position             */
#define SPI_CTL_TXNEG_Msk           ( 0x1ul << SPI_CTL_TXNEG_Pos )                         /*!< SPI_T::CTL: TXNEG Mask                 */

#define SPI_CTL_CLKPOL_Pos          ( 3 )                                                  /*!< SPI_T::CTL: CLKPOL Position            */
#define SPI_CTL_CLKPOL_Msk          ( 0x1ul << SPI_CTL_CLKPOL_Pos )                        /*!< SPI_T::CTL: CLKPOL Mask                */

#define SPI_CTL_SUSPITV_Pos         ( 4 )                                                  /*!< SPI_T::CTL: SUSPITV Position           */
#define SPI_CTL_SUSPITV_Msk         ( 0xful << SPI_CTL_SUSPITV_Pos )                       /*!< SPI_T::CTL: SUSPITV Mask               */

#define SPI_CTL_DWIDTH_Pos          ( 8 )                                                  /*!< SPI_T::CTL: DWIDTH Position            */
#define SPI_CTL_DWIDTH_Msk          ( 0x1ful << SPI_CTL_DWIDTH_Pos )                       /*!< SPI_T::CTL: DWIDTH Mask                */

#define SPI_CTL_LSB_Pos             ( 13 )                                                 /*!< SPI_T::CTL: LSB Position               */
#define SPI_CTL_LSB_Msk             ( 0x1ul << SPI_CTL_LSB_Pos )                           /*!< SPI_T::CTL: LSB Mask                   */

#define SPI_CTL_HALFDPX_Pos         ( 14 )                                                 /*!< SPI_T::CTL: HALFDPX Position           */
#define SPI_CTL_HALFDPX_Msk         ( 0x1ul << SPI_CTL_HALFDPX_Pos )                       /*!< SPI_T::CTL: HALFDPX Mask               */

#define SPI_CTL_RXONLY_Pos          ( 15 )                                                 /*!< SPI_T::CTL: RXONLY Position            */
#define SPI_CTL_RXONLY_Msk          ( 0x1ul << SPI_CTL_RXONLY_Pos )                        /*!< SPI_T::CTL: RXONLY Mask                */

#define SPI_CTL_UNITIEN_Pos         ( 17 )                                                 /*!< SPI_T::CTL: UNITIEN Position           */
#define SPI_CTL_UNITIEN_Msk         ( 0x1ul << SPI_CTL_UNITIEN_Pos )                       /*!< SPI_T::CTL: UNITIEN Mask               */

#define SPI_CTL_SLAVE_Pos           ( 18 )                                                 /*!< SPI_T::CTL: SLAVE Position             */
#define SPI_CTL_SLAVE_Msk           ( 0x1ul << SPI_CTL_SLAVE_Pos )                         /*!< SPI_T::CTL: SLAVE Mask                 */

#define SPI_CTL_REORDER_Pos         ( 19 )                                                 /*!< SPI_T::CTL: REORDER Position           */
#define SPI_CTL_REORDER_Msk         ( 0x1ul << SPI_CTL_REORDER_Pos )                       /*!< SPI_T::CTL: REORDER Mask               */

#define SPI_CTL_DATDIR_Pos          ( 20 )                                                 /*!< SPI_T::CTL: DATDIR Position            */
#define SPI_CTL_DATDIR_Msk          ( 0x1ul << SPI_CTL_DATDIR_Pos )                        /*!< SPI_T::CTL: DATDIR Mask                */

#define SPI_CLKDIV_DIVIDER_Pos      ( 0 )                                                  /*!< SPI_T::CLKDIV: DIVIDER Position        */
#define SPI_CLKDIV_DIVIDER_Msk      ( 0x1fful << SPI_CLKDIV_DIVIDER_Pos )                  /*!< SPI_T::CLKDIV: DIVIDER Mask            */

#define SPI_SSCTL_SS_Pos            ( 0 )                                                  /*!< SPI_T::SSCTL: SS Position              */
#define SPI_SSCTL_SS_Msk            ( 0x1ul << SPI_SSCTL_SS_Pos )                          /*!< SPI_T::SSCTL: SS Mask                  */

#define SPI_SSCTL_SSACTPOL_Pos      ( 2 )                                                  /*!< SPI_T::SSCTL: SSACTPOL Position        */
#define SPI_SSCTL_SSACTPOL_Msk      ( 0x1ul << SPI_SSCTL_SSACTPOL_Pos )                    /*!< SPI_T::SSCTL: SSACTPOL Mask            */

#define SPI_SSCTL_AUTOSS_Pos        ( 3 )                                                  /*!< SPI_T::SSCTL: AUTOSS Position          */
#define SPI_SSCTL_AUTOSS_Msk        ( 0x1ul << SPI_SSCTL_AUTOSS_Pos )                      /*!< SPI_T::SSCTL: AUTOSS Mask              */

#define SPI_SSCTL_SLVBEIEN_Pos      ( 8 )                                                  /*!< SPI_T::SSCTL: SLVBEIEN Position        */
#define SPI_SSCTL_SLVBEIEN_Msk      ( 0x1ul << SPI_SSCTL_SLVBEIEN_Pos )                    /*!< SPI_T::SSCTL: SLVBEIEN Mask            */

#define SPI_SSCTL_SLVURIEN_Pos      ( 9 )                                                  /*!< SPI_T::SSCTL: SLVURIEN Position        */
#define SPI_SSCTL_SLVURIEN_Msk      ( 0x1ul << SPI_SSCTL_SLVURIEN_Pos )                    /*!< SPI_T::SSCTL: SLVURIEN Mask            */

#define SPI_SSCTL_SSACTIEN_Pos      ( 12 )                                                 /*!< SPI_T::SSCTL: SSACTIEN Position        */
#define SPI_SSCTL_SSACTIEN_Msk      ( 0x1ul << SPI_SSCTL_SSACTIEN_Pos )                    /*!< SPI_T::SSCTL: SSACTIEN Mask            */

#define SPI_SSCTL_SSINAIEN_Pos      ( 13 )                                                 /*!< SPI_T::SSCTL: SSINAIEN Position        */
#define SPI_SSCTL_SSINAIEN_Msk      ( 0x1ul << SPI_SSCTL_SSINAIEN_Pos )                    /*!< SPI_T::SSCTL: SSINAIEN Mask            */

#define SPI_PDMACTL_TXPDMAEN_Pos    ( 0 )                                                  /*!< SPI_T::PDMACTL: TXPDMAEN Position      */
#define SPI_PDMACTL_TXPDMAEN_Msk    ( 0x1ul << SPI_PDMACTL_TXPDMAEN_Pos )                  /*!< SPI_T::PDMACTL: TXPDMAEN Mask          */

#define SPI_PDMACTL_RXPDMAEN_Pos    ( 1 )                                                  /*!< SPI_T::PDMACTL: RXPDMAEN Position      */
#define SPI_PDMACTL_RXPDMAEN_Msk    ( 0x1ul << SPI_PDMACTL_RXPDMAEN_Pos )                  /*!< SPI_T::PDMACTL: RXPDMAEN Mask          */

#define SPI_PDMACTL_PDMARST_Pos     ( 2 )                                                  /*!< SPI_T::PDMACTL: PDMARST Position       */
#define SPI_PDMACTL_PDMARST_Msk     ( 0x1ul << SPI_PDMACTL_PDMARST_Pos )                   /*!< SPI_T::PDMACTL: PDMARST Mask           */

