FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/spi_reg.h
#define SPI_FIFOCTL_RXRST_Pos       ( 0 )                                                  /*!< SPI_T::FIFOCTL: RXRST Position         */
#define SPI_FIFOCTL_RXRST_Msk       ( 0x1ul << SPI_FIFOCTL_RXRST_Pos )                     /*!< SPI_T::FIFOCTL: RXRST Mask             */

#define SPI_FIFOCTL_TXRST_Pos       ( 1 )                                                  /*!< SPI_T::FIFOCTL: TXRST Position         */
#define SPI_FIFOCTL_TXRST_Msk       ( 0x1ul << SPI_FIFOCTL_TXRST_Pos )                     /*!< SPI_T::FIFOCTL: TXRST Mask             */

#define SPI_FIFOCTL_RXTHIEN_Pos     ( 2 )                                                  /*!< SPI_T::FIFOCTL: RXTHIEN Position       */
#define SPI_FIFOCTL_RXTHIEN_Msk     ( 0x1ul << SPI_FIFOCTL_RXTHIEN_Pos )                   /*!< SPI_T::FIFOCTL: RXTHIEN Mask           */

#define SPI_FIFOCTL_TXTHIEN_Pos     ( 3 )                                                  /*!< SPI_T::FIFOCTL: TXTHIEN Position       */
#define SPI_FIFOCTL_TXTHIEN_Msk     ( 0x1ul << SPI_FIFOCTL_TXTHIEN_Pos )                   /*!< SPI_T::FIFOCTL: TXTHIEN Mask           */

#define SPI_FIFOCTL_RXTOIEN_Pos     ( 4 )                                                  /*!< SPI_T::FIFOCTL: RXTOIEN Position       */
#define SPI_FIFOCTL_RXTOIEN_Msk     ( 0x1ul << SPI_FIFOCTL_RXTOIEN_Pos )                   /*!< SPI_T::FIFOCTL: RXTOIEN Mask           */

#define SPI_FIFOCTL_RXOVIEN_Pos     ( 5 )                                                  /*!< SPI_T::FIFOCTL: RXOVIEN Position       */
#define SPI_FIFOCTL_RXOVIEN_Msk     ( 0x1ul << SPI_FIFOCTL_RXOVIEN_Pos )                   /*!< SPI_T::FIFOCTL: RXOVIEN Mask           */

#define SPI_FIFOCTL_TXUFPOL_Pos     ( 6 )                                                  /*!< SPI_T::FIFOCTL: TXUFPOL Position       */
#define SPI_FIFOCTL_TXUFPOL_Msk     ( 0x1ul << SPI_FIFOCTL_TXUFPOL_Pos )                   /*!< SPI_T::FIFOCTL: TXUFPOL Mask           */

#define SPI_FIFOCTL_TXUFIEN_Pos     ( 7 )                                                  /*!< SPI_T::FIFOCTL: TXUFIEN Position       */
#define SPI_FIFOCTL_TXUFIEN_Msk     ( 0x1ul << SPI_FIFOCTL_TXUFIEN_Pos )                   /*!< SPI_T::FIFOCTL: TXUFIEN Mask           */

#define SPI_FIFOCTL_RXFBCLR_Pos     ( 8 )                                                  /*!< SPI_T::FIFOCTL: RXFBCLR Position       */
#define SPI_FIFOCTL_RXFBCLR_Msk     ( 0x1ul << SPI_FIFOCTL_RXFBCLR_Pos )                   /*!< SPI_T::FIFOCTL: RXFBCLR Mask           */

#define SPI_FIFOCTL_TXFBCLR_Pos     ( 9 )                                                  /*!< SPI_T::FIFOCTL: TXFBCLR Position       */
#define SPI_FIFOCTL_TXFBCLR_Msk     ( 0x1ul << SPI_FIFOCTL_TXFBCLR_Pos )                   /*!< SPI_T::FIFOCTL: TXFBCLR Mask           */

#define SPI_FIFOCTL_RXTH_Pos        ( 24 )                                                 /*!< SPI_T::FIFOCTL: RXTH Position          */
#define SPI_FIFOCTL_RXTH_Msk        ( 0x7ul << SPI_FIFOCTL_RXTH_Pos )                      /*!< SPI_T::FIFOCTL: RXTH Mask              */

#define SPI_FIFOCTL_TXTH_Pos        ( 28 )                                                 /*!< SPI_T::FIFOCTL: TXTH Position          */
#define SPI_FIFOCTL_TXTH_Msk        ( 0x7ul << SPI_FIFOCTL_TXTH_Pos )                      /*!< SPI_T::FIFOCTL: TXTH Mask              */

#define SPI_STATUS_BUSY_Pos         ( 0 )                                                  /*!< SPI_T::STATUS: BUSY Position           */
#define SPI_STATUS_BUSY_Msk         ( 0x1ul << SPI_STATUS_BUSY_Pos )                       /*!< SPI_T::STATUS: BUSY Mask               */

#define SPI_STATUS_UNITIF_Pos       ( 1 )                                                  /*!< SPI_T::STATUS: UNITIF Position         */
#define SPI_STATUS_UNITIF_Msk       ( 0x1ul << SPI_STATUS_UNITIF_Pos )                     /*!< SPI_T::STATUS: UNITIF Mask             */

#define SPI_STATUS_SSACTIF_Pos      ( 2 )                                                  /*!< SPI_T::STATUS: SSACTIF Position        */
#define SPI_STATUS_SSACTIF_Msk      ( 0x1ul << SPI_STATUS_SSACTIF_Pos )                    /*!< SPI_T::STATUS: SSACTIF Mask            */

#define SPI_STATUS_SSINAIF_Pos      ( 3 )                                                  /*!< SPI_T::STATUS: SSINAIF Position        */
#define SPI_STATUS_SSINAIF_Msk      ( 0x1ul << SPI_STATUS_SSINAIF_Pos )                    /*!< SPI_T::STATUS: SSINAIF Mask            */

#define SPI_STATUS_SSLINE_Pos       ( 4 )                                                  /*!< SPI_T::STATUS: SSLINE Position         */
#define SPI_STATUS_SSLINE_Msk       ( 0x1ul << SPI_STATUS_SSLINE_Pos )                     /*!< SPI_T::STATUS: SSLINE Mask             */

#define SPI_STATUS_SLVBEIF_Pos      ( 6 )                                                  /*!< SPI_T::STATUS: SLVBEIF Position        */
#define SPI_STATUS_SLVBEIF_Msk      ( 0x1ul << SPI_STATUS_SLVBEIF_Pos )                    /*!< SPI_T::STATUS: SLVBEIF Mask            */

#define SPI_STATUS_SLVURIF_Pos      ( 7 )                                                  /*!< SPI_T::STATUS: SLVURIF Position        */
#define SPI_STATUS_SLVURIF_Msk      ( 0x1ul << SPI_STATUS_SLVURIF_Pos )                    /*!< SPI_T::STATUS: SLVURIF Mask            */

#define SPI_STATUS_RXEMPTY_Pos      ( 8 )                                                  /*!< SPI_T::STATUS: RXEMPTY Position        */
#define SPI_STATUS_RXEMPTY_Msk      ( 0x1ul << SPI_STATUS_RXEMPTY_Pos )                    /*!< SPI_T::STATUS: RXEMPTY Mask            */

#define SPI_STATUS_RXFULL_Pos       ( 9 )                                                  /*!< SPI_T::STATUS: RXFULL Position         */
#define SPI_STATUS_RXFULL_Msk       ( 0x1ul << SPI_STATUS_RXFULL_Pos )                     /*!< SPI_T::STATUS: RXFULL Mask             */

#define SPI_STATUS_RXTHIF_Pos       ( 10 )                                                 /*!< SPI_T::STATUS: RXTHIF Position         */
#define SPI_STATUS_RXTHIF_Msk       ( 0x1ul << SPI_STATUS_RXTHIF_Pos )                     /*!< SPI_T::STATUS: RXTHIF Mask             */

#define SPI_STATUS_RXOVIF_Pos       ( 11 )                                                 /*!< SPI_T::STATUS: RXOVIF Position         */
#define SPI_STATUS_RXOVIF_Msk       ( 0x1ul << SPI_STATUS_RXOVIF_Pos )                     /*!< SPI_T::STATUS: RXOVIF Mask             */

#define SPI_STATUS_RXTOIF_Pos       ( 12 )                                                 /*!< SPI_T::STATUS: RXTOIF Position         */
#define SPI_STATUS_RXTOIF_Msk       ( 0x1ul << SPI_STATUS_RXTOIF_Pos )                     /*!< SPI_T::STATUS: RXTOIF Mask             */

