FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/spi_reg.h
#define SPI_STATUS_SPIENSTS_Pos     ( 15 )                                                 /*!< SPI_T::STATUS: SPIENSTS Position       */
#define SPI_STATUS_SPIENSTS_Msk     ( 0x1ul << SPI_STATUS_SPIENSTS_Pos )                   /*!< SPI_T::STATUS: SPIENSTS Mask           */

#define SPI_STATUS_TXEMPTY_Pos      ( 16 )                                                 /*!< SPI_T::STATUS: TXEMPTY Position        */
#define SPI_STATUS_TXEMPTY_Msk      ( 0x1ul << SPI_STATUS_TXEMPTY_Pos )                    /*!< SPI_T::STATUS: TXEMPTY Mask            */

#define SPI_STATUS_TXFULL_Pos       ( 17 )                                                 /*!< SPI_T::STATUS: TXFULL Position         */
#define SPI_STATUS_TXFULL_Msk       ( 0x1ul << SPI_STATUS_TXFULL_Pos )                     /*!< SPI_T::STATUS: TXFULL Mask             */

#define SPI_STATUS_TXTHIF_Pos       ( 18 )                                                 /*!< SPI_T::STATUS: TXTHIF Position         */
#define SPI_STATUS_TXTHIF_Msk       ( 0x1ul << SPI_STATUS_TXTHIF_Pos )                     /*!< SPI_T::STATUS: TXTHIF Mask             */

#define SPI_STATUS_TXUFIF_Pos       ( 19 )                                                 /*!< SPI_T::STATUS: TXUFIF Position         */
#define SPI_STATUS_TXUFIF_Msk       ( 0x1ul << SPI_STATUS_TXUFIF_Pos )                     /*!< SPI_T::STATUS: TXUFIF Mask             */

#define SPI_STATUS_TXRXRST_Pos      ( 23 )                                                 /*!< SPI_T::STATUS: TXRXRST Position        */
#define SPI_STATUS_TXRXRST_Msk      ( 0x1ul << SPI_STATUS_TXRXRST_Pos )                    /*!< SPI_T::STATUS: TXRXRST Mask            */

#define SPI_STATUS_RXCNT_Pos        ( 24 )                                                 /*!< SPI_T::STATUS: RXCNT Position          */
#define SPI_STATUS_RXCNT_Msk        ( 0xful << SPI_STATUS_RXCNT_Pos )                      /*!< SPI_T::STATUS: RXCNT Mask              */

#define SPI_STATUS_TXCNT_Pos        ( 28 )                                                 /*!< SPI_T::STATUS: TXCNT Position          */
#define SPI_STATUS_TXCNT_Msk        ( 0xful << SPI_STATUS_TXCNT_Pos )                      /*!< SPI_T::STATUS: TXCNT Mask              */

#define SPI_TX_TX_Pos               ( 0 )                                                  /*!< SPI_T::TX: TX Position                 */
#define SPI_TX_TX_Msk               ( 0xfffffffful << SPI_TX_TX_Pos )                      /*!< SPI_T::TX: TX Mask                     */

#define SPI_RX_RX_Pos               ( 0 )                                                  /*!< SPI_T::RX: RX Position                 */
#define SPI_RX_RX_Msk               ( 0xfffffffful << SPI_RX_RX_Pos )                      /*!< SPI_T::RX: RX Mask                     */

#define SPI_I2SCTL_I2SEN_Pos        ( 0 )                                                  /*!< SPI_T::I2SCTL: I2SEN Position          */
#define SPI_I2SCTL_I2SEN_Msk        ( 0x1ul << SPI_I2SCTL_I2SEN_Pos )                      /*!< SPI_T::I2SCTL: I2SEN Mask              */

#define SPI_I2SCTL_TXEN_Pos         ( 1 )                                                  /*!< SPI_T::I2SCTL: TXEN Position           */
#define SPI_I2SCTL_TXEN_Msk         ( 0x1ul << SPI_I2SCTL_TXEN_Pos )                       /*!< SPI_T::I2SCTL: TXEN Mask               */

#define SPI_I2SCTL_RXEN_Pos         ( 2 )                                                  /*!< SPI_T::I2SCTL: RXEN Position           */
#define SPI_I2SCTL_RXEN_Msk         ( 0x1ul << SPI_I2SCTL_RXEN_Pos )                       /*!< SPI_T::I2SCTL: RXEN Mask               */

#define SPI_I2SCTL_MUTE_Pos         ( 3 )                                                  /*!< SPI_T::I2SCTL: MUTE Position           */
#define SPI_I2SCTL_MUTE_Msk         ( 0x1ul << SPI_I2SCTL_MUTE_Pos )                       /*!< SPI_T::I2SCTL: MUTE Mask               */

#define SPI_I2SCTL_WDWIDTH_Pos      ( 4 )                                                  /*!< SPI_T::I2SCTL: WDWIDTH Position        */
#define SPI_I2SCTL_WDWIDTH_Msk      ( 0x3ul << SPI_I2SCTL_WDWIDTH_Pos )                    /*!< SPI_T::I2SCTL: WDWIDTH Mask            */

#define SPI_I2SCTL_MONO_Pos         ( 6 )                                                  /*!< SPI_T::I2SCTL: MONO Position           */
#define SPI_I2SCTL_MONO_Msk         ( 0x1ul << SPI_I2SCTL_MONO_Pos )                       /*!< SPI_T::I2SCTL: MONO Mask               */

#define SPI_I2SCTL_ORDER_Pos        ( 7 )                                                  /*!< SPI_T::I2SCTL: ORDER Position          */
#define SPI_I2SCTL_ORDER_Msk        ( 0x1ul << SPI_I2SCTL_ORDER_Pos )                      /*!< SPI_T::I2SCTL: ORDER Mask              */

#define SPI_I2SCTL_SLAVE_Pos        ( 8 )                                                  /*!< SPI_T::I2SCTL: SLAVE Position          */
#define SPI_I2SCTL_SLAVE_Msk        ( 0x1ul << SPI_I2SCTL_SLAVE_Pos )                      /*!< SPI_T::I2SCTL: SLAVE Mask              */

#define SPI_I2SCTL_MCLKEN_Pos       ( 15 )                                                 /*!< SPI_T::I2SCTL: MCLKEN Position         */
#define SPI_I2SCTL_MCLKEN_Msk       ( 0x1ul << SPI_I2SCTL_MCLKEN_Pos )                     /*!< SPI_T::I2SCTL: MCLKEN Mask             */

#define SPI_I2SCTL_RZCEN_Pos        ( 16 )                                                 /*!< SPI_T::I2SCTL: RZCEN Position          */
#define SPI_I2SCTL_RZCEN_Msk        ( 0x1ul << SPI_I2SCTL_RZCEN_Pos )                      /*!< SPI_T::I2SCTL: RZCEN Mask              */

#define SPI_I2SCTL_LZCEN_Pos        ( 17 )                                                 /*!< SPI_T::I2SCTL: LZCEN Position          */
#define SPI_I2SCTL_LZCEN_Msk        ( 0x1ul << SPI_I2SCTL_LZCEN_Pos )                      /*!< SPI_T::I2SCTL: LZCEN Mask              */

#define SPI_I2SCTL_RXLCH_Pos        ( 23 )                                                 /*!< SPI_T::I2SCTL: RXLCH Position          */
#define SPI_I2SCTL_RXLCH_Msk        ( 0x1ul << SPI_I2SCTL_RXLCH_Pos )                      /*!< SPI_T::I2SCTL: RXLCH Mask              */

#define SPI_I2SCTL_RZCIEN_Pos       ( 24 )                                                 /*!< SPI_T::I2SCTL: RZCIEN Position         */
#define SPI_I2SCTL_RZCIEN_Msk       ( 0x1ul << SPI_I2SCTL_RZCIEN_Pos )                     /*!< SPI_T::I2SCTL: RZCIEN Mask             */

#define SPI_I2SCTL_LZCIEN_Pos       ( 25 )                                                 /*!< SPI_T::I2SCTL: LZCIEN Position         */
#define SPI_I2SCTL_LZCIEN_Msk       ( 0x1ul << SPI_I2SCTL_LZCIEN_Pos )                     /*!< SPI_T::I2SCTL: LZCIEN Mask             */

#define SPI_I2SCTL_FORMAT_Pos       ( 28 )                                                 /*!< SPI_T::I2SCTL: FORMAT Position         */
#define SPI_I2SCTL_FORMAT_Msk       ( 0x3ul << SPI_I2SCTL_FORMAT_Pos )                     /*!< SPI_T::I2SCTL: FORMAT Mask             */

#define SPI_I2SCLK_MCLKDIV_Pos      ( 0 )                                                  /*!< SPI_T::I2SCLK: MCLKDIV Position        */
#define SPI_I2SCLK_MCLKDIV_Msk      ( 0x7ful << SPI_I2SCLK_MCLKDIV_Pos )                   /*!< SPI_T::I2SCLK: MCLKDIV Mask            */

#define SPI_I2SCLK_BCLKDIV_Pos      ( 8 )                                                  /*!< SPI_T::I2SCLK: BCLKDIV Position        */
#define SPI_I2SCLK_BCLKDIV_Msk      ( 0x3fful << SPI_I2SCLK_BCLKDIV_Pos )                  /*!< SPI_T::I2SCLK: BCLKDIV Mask            */

