FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/spi_reg.h
#define SPI_I2SSTS_RIGHT_Pos        ( 4 )                                                  /*!< SPI_T::I2SSTS: RIGHT Position          */
#define SPI_I2SSTS_RIGHT_Msk        ( 0x1ul << SPI_I2SSTS_RIGHT_Pos )                      /*!< SPI_T::I2SSTS: RIGHT Mask              */

#define SPI_I2SSTS_RXEMPTY_Pos      ( 8 )                                                  /*!< SPI_T::I2SSTS: RXEMPTY Position        */
#define SPI_I2SSTS_RXEMPTY_Msk      ( 0x1ul << SPI_I2SSTS_RXEMPTY_Pos )                    /*!< SPI_T::I2SSTS: RXEMPTY Mask            */

#define SPI_I2SSTS_RXFULL_Pos       ( 9 )                                                  /*!< SPI_T::I2SSTS: RXFULL Position         */
#define SPI_I2SSTS_RXFULL_Msk       ( 0x1ul << SPI_I2SSTS_RXFULL_Pos )                     /*!< SPI_T::I2SSTS: RXFULL Mask             */

#define SPI_I2SSTS_RXTHIF_Pos       ( 10 )                                                 /*!< SPI_T::I2SSTS: RXTHIF Position         */
#define SPI_I2SSTS_RXTHIF_Msk       ( 0x1ul << SPI_I2SSTS_RXTHIF_Pos )                     /*!< SPI_T::I2SSTS: RXTHIF Mask             */

#define SPI_I2SSTS_RXOVIF_Pos       ( 11 )                                                 /*!< SPI_T::I2SSTS: RXOVIF Position         */
#define SPI_I2SSTS_RXOVIF_Msk       ( 0x1ul << SPI_I2SSTS_RXOVIF_Pos )                     /*!< SPI_T::I2SSTS: RXOVIF Mask             */

#define SPI_I2SSTS_RXTOIF_Pos       ( 12 )                                                 /*!< SPI_T::I2SSTS: RXTOIF Position         */
#define SPI_I2SSTS_RXTOIF_Msk       ( 0x1ul << SPI_I2SSTS_RXTOIF_Pos )                     /*!< SPI_T::I2SSTS: RXTOIF Mask             */

#define SPI_I2SSTS_I2SENSTS_Pos     ( 15 )                                                 /*!< SPI_T::I2SSTS: I2SENSTS Position       */
#define SPI_I2SSTS_I2SENSTS_Msk     ( 0x1ul << SPI_I2SSTS_I2SENSTS_Pos )                   /*!< SPI_T::I2SSTS: I2SENSTS Mask           */

#define SPI_I2SSTS_TXEMPTY_Pos      ( 16 )                                                 /*!< SPI_T::I2SSTS: TXEMPTY Position        */
#define SPI_I2SSTS_TXEMPTY_Msk      ( 0x1ul << SPI_I2SSTS_TXEMPTY_Pos )                    /*!< SPI_T::I2SSTS: TXEMPTY Mask            */

#define SPI_I2SSTS_TXFULL_Pos       ( 17 )                                                 /*!< SPI_T::I2SSTS: TXFULL Position         */
#define SPI_I2SSTS_TXFULL_Msk       ( 0x1ul << SPI_I2SSTS_TXFULL_Pos )                     /*!< SPI_T::I2SSTS: TXFULL Mask             */

#define SPI_I2SSTS_TXTHIF_Pos       ( 18 )                                                 /*!< SPI_T::I2SSTS: TXTHIF Position         */
#define SPI_I2SSTS_TXTHIF_Msk       ( 0x1ul << SPI_I2SSTS_TXTHIF_Pos )                     /*!< SPI_T::I2SSTS: TXTHIF Mask             */

#define SPI_I2SSTS_TXUFIF_Pos       ( 19 )                                                 /*!< SPI_T::I2SSTS: TXUFIF Position         */
#define SPI_I2SSTS_TXUFIF_Msk       ( 0x1ul << SPI_I2SSTS_TXUFIF_Pos )                     /*!< SPI_T::I2SSTS: TXUFIF Mask             */

#define SPI_I2SSTS_RZCIF_Pos        ( 20 )                                                 /*!< SPI_T::I2SSTS: RZCIF Position          */
#define SPI_I2SSTS_RZCIF_Msk        ( 0x1ul << SPI_I2SSTS_RZCIF_Pos )                      /*!< SPI_T::I2SSTS: RZCIF Mask              */

#define SPI_I2SSTS_LZCIF_Pos        ( 21 )                                                 /*!< SPI_T::I2SSTS: LZCIF Position          */
#define SPI_I2SSTS_LZCIF_Msk        ( 0x1ul << SPI_I2SSTS_LZCIF_Pos )                      /*!< SPI_T::I2SSTS: LZCIF Mask              */

#define SPI_I2SSTS_TXRXRST_Pos      ( 23 )                                                 /*!< SPI_T::I2SSTS: TXRXRST Position        */
#define SPI_I2SSTS_TXRXRST_Msk      ( 0x1ul << SPI_I2SSTS_TXRXRST_Pos )                    /*!< SPI_T::I2SSTS: TXRXRST Mask            */

#define SPI_I2SSTS_RXCNT_Pos        ( 24 )                                                 /*!< SPI_T::I2SSTS: RXCNT Position          */
#define SPI_I2SSTS_RXCNT_Msk        ( 0x7ul << SPI_I2SSTS_RXCNT_Pos )                      /*!< SPI_T::I2SSTS: RXCNT Mask              */

#define SPI_I2SSTS_TXCNT_Pos        ( 28 )                                                 /*!< SPI_T::I2SSTS: TXCNT Position          */
#define SPI_I2SSTS_TXCNT_Msk        ( 0x7ul << SPI_I2SSTS_TXCNT_Pos )                      /*!< SPI_T::I2SSTS: TXCNT Mask              */

/**@}*/ /* SPI_CONST */
/**@}*/ /* end of SPI register group */
/**@}*/ /* end of REGISTER group */


#endif /* __SPI_REG_H__ */
